[
  {
    "id": "a36bf814-bccd-4bfa-bc7d-f4e3a823ffda",
    "genre": "informational",
    "title": null,
    "text": "passage. You may need to review both the quotation and the passage in order to answer\nthe question correctly.\nMalawi, Africa. is region had suffered a long, terrible drought that caused crop failure and\nfamine.\nExcerpt from\nWinds of Hope\nby Katy Duffield\nWilliam hoped that life could now return to normal. He’d worked hard to pass the\nexams to enter high school. When the term began, however, William’s father explained\nthat, because of the drought, there was no money to pay his school fees. It appeared\nthat William’s education would end at eighth grade.\n1\nough he could not attend school, William still wanted to learn. He was curious\nabout many things. He took apart radios, trying to discover how they made music. One\nday, turning a bicycle upside down and cranking the pedals by hand, he figured out that\nthe dynamo that generated electricity for the headlight could be wired to power a radio\ninstead. He asked how gasoline made cars run and how CDs stored songs. No one\nknew, or even cared much about his questions.\n2\nSome days, William visited the village library. It had only three shelves, but William\nfound books that interested him—science books about how things worked. William\nwould check out\nExplaining Physics or\nIntegrated Science, plop under a mango tree,\nand pore over the drawings and diagrams inside. Since his English was not very good,\nhe oen looked up words in the dictionary or asked the librarian. He wondered if\nsomething in these books might be useful to his family.\n3\nOne day, while looking for a dictionary on the bottom shelf, he found a book he\nhadn’t seen before pushed behind the others. It was an American school textbook\ncalled\nUsing Energy. On the book’s cover was a picture of a row of windmills, tall steel\ntowers with blades spinning like giant fans. ey reminded William of the toy\npinwheels he’d made with his friends.\n4\nFrom this book William learned that wind—something of which Malawi had\nplenty—could produce electricity. William was delighted! Only two percent of the\nhouses in Malawi have electricity. Aer the sun sets, everyone s what they’re doing,\nbrushes their teeth, and goes to sleep—at seven in the evening! If William could build a\n5\npump water to irrigate the family’s maize fields. If another drought came, the windmill\ncould provide the water for life.\nWilliam could picture in his mind the windmill he wanted to build, but collecting\nthe parts and tools he needed would take months. In a junkyard across from the high\nschool, William dug through piles of twisted metal, rusted cars, and worn-out tractors,\nsearching for anything that might help him construct his machine. He took a ring of\nball bearings from an old peanut grinder and the cooling fan from a tractor engine.\nCracking open a shock absorber, he removed the steel piston inside. He made four-\nfoot-long blades from plastic pipe, which he melted over a fire, flattened out, and\nstiffened with bamboo poles.\n6\nEarning some money loading logs into a truck, he paid a welder to attach the piston\nto the pedal sprocket of an old bicycle frame. is would be the axle of the windmill.\nWhen the wind blew, the rotating blades would turn the bicycle wheel, like someone\npedaling, and spin a small dynamo. Although he had no money for a dynamo, a friend\ncame to the rescue and bought one from a man in the road, right off his bike.\n7\nVillage kids laughed at William when they saw him scrounging in the scrap yard.\ney called him\nmisala, which means crazy. But William was too focused on his idea to\ncare.\n8\nWhen he had collected all the parts, William took them out of the corner of his\nbedroom, laid them outside in the shade of an acacia tree, and began putting them\ntogether. Since he did not have a drill to make bolt holes, he shoved a nail through a\nmaize cob, heated it in the fire, then pushed its point through the plastic blades. He\nbolted the blades to the tractor fan, using washers he’d made from bottle caps. Next he\npushed the fan onto the piston welded to the bicycle frame. With the help of his two\nbest friends, William built a 16-foot-tall tower from trunks of blue gum trees and\nhoisted the ninety-pound windmill to the top.\n9\nShoppers, farmers, and traders could see William’s tower from the local market.\ney came in a long line to find out what the “crazy” boy was up to. “What is it?” they\nall asked.\n10\nSince there is no word for “windmill” in Chichewa, the language of Malawi, William\nanswered with the phrase\nmagetsi a mphepo—“electric wind.” From the top of the\ntower he explained that, by using the power of wind, his machine could create\nelectricity. No one believed him.\n11\nWilliam knew this was his moment—his moment to show everyone he wasn’t crazy,\nto find out if his experiment would work. He connected two wires from the dynamo to\na light socket he’d made from a reed and that held a small bulb. As the wind whipped\naround him, he removed the bent spoke he’d jammed into the wheel to lock it. en he\nheld his breath. . . .\n12\ne blades began to turn, slowly at first, then faster and faster. e light bulb\nflickered, then flashed to life. e crowd cheered from below. “\nWachitabwina! Well\ndone!”\n13\nA month later William found enough wire to reach from the windmill into his\nhouse. His family crowded around to marvel as the small bulb lit up in William’s room.\nReading\nExplaining Physics by its light, he stayed up long aer others had gone to bed.",
    "lexile_band": null,
    "word_count": 966,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2019-released-items-ela-g7.pdf",
    "grade": 7,
    "state": "NY",
    "created_at": "2025-12-31T15:18:41.538Z"
  },
  {
    "id": "eeeb5453-e66c-46bc-9619-f4dfe6c9d903",
    "genre": "informational",
    "title": null,
    "text": ". Most life on Earth depends on sunlight. How could sunlight penetrate an ice\ncover thousands of feet deep? Living things also depend on nutrients to grow. Where\nwould these come from? Scientists wondered how nutrients could enter a system that\nhas been cut off from the world above for millions of years. What’s more, they knew\nthat any kind of life in this extreme environment would have to survive tons and tons\nof pressure from the ice above.\n10\nYet, in the deep ocean, some life forms exist without sunlight. eir nutrients come\nfrom the chemicals that rise through the ocean floor from deep inside the Earth. ese\ncreatures have developed qualities that allow them to thrive under the weight of tons of\nwater.\n11\nCould living things with similar abilities exist in Antarctica’s subglacial wetland? If\nthey do, life might also be possible in the icy moons of the outer solar system.\n12\nLooking for Proof\nFirst, scientists needed to obtain and test water samples from Antarctica’s hidden\nworld. It was easier said than done. Antarctica’s extreme cold and short summer season\npermits only a few months of research each year. Even then, drilling into the ice posed\nanother big problem.\n13\nDrilling technology uses chemicals like kerosene and Freon to help melt the ice,\nmake a borehole, and keep it open. If the drill penetrated the lake, the chemicals could\ncontaminate the water. is process could also introduce microbes from the surface\ninto water that had been isolated from the rest of the world for millions of years.\n14\nScientists had been drilling into the ice above Lake Vostok long before its discovery.\ne ice cores they obtained helped them study a record of Antarctica’s climate going\nback hundreds of thousands of years. Ice just above the lake showed signs of\nmicroscopic life. It was a clue but it was not proof.\n15\nA research team penetrated Lake Vostok in 2012. ey used chemicals to melt the\nice and to keep the borehole open. However, they believed they did not contaminate\nthe lake because water rushed into the borehole and froze. e team removed the ice\ncore to study it. However, many other scientists questioned this method.",
    "lexile_band": null,
    "word_count": 370,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2019-released-items-ela-g7.pdf",
    "grade": 7,
    "state": "NY",
    "created_at": "2025-12-31T15:18:41.539Z"
  },
  {
    "id": "dea7c5a1-dbcf-43c3-9067-066a5493d384",
    "genre": "poetry",
    "title": null,
    "text": "passage. You may need to review both the quotation and the passage in order to answer\nthe question correctly.\n– accurately and completely answer the questions being asked;\n– support your responses with examples or details from the text; and\n– write in complete sentences using correct spelling, grammar, capitalization,\nand punctuation.\nprovided, but do NOT write your final answer on this Planning Page. Writing on this\nPlanning Page will NOT count toward your final score. Write your final answer on the\nlined response pages provided.\n5\n10\n15\n20\nAt Dusk\nby Natasha Trethewey\nAt first I think she is calling a child,\nmy neighbor, leaning through her doorway\nat dusk, street lamps just starting to hum\nthe backdrop of evening. en I hear\nthe high-pitched wheedling we send out\nto animals who know only sound, not\nthe meanings of our words—\nhere here—\nnor how they sometimes fall short.\nIn another yard, beyond my neighbor’s\nsight, the cat lis her ears, turns first\ntoward the voice, then back\nto the constellation of fireflies flickering\nnear her head. It’s as if she can’t decide\nwhether to leap over the low hedge,\nthe neat row of flowers, and bound\nonto the porch, into the steady circle\nof light, or stay where she is: luminous 1\npossibility—all that would keep her\naway from home—flitting before her.\nI listen as my neighbor’s voice trails off.\nShe’s given up calling for now, le me\nto imagine her inside the house waiting,\nperhaps in a chair in front of the TV,\nor walking around, doing small tasks;\nmy voice, sure of someone out there,\nsend it over the lines stitching here\nto there, certain the sounds I make\nare enough to call someone home.\n_______________________\n1luminous: filled with light\nHow do the poet’s word choices in lines 1 through 8 of “At Dusk” establish the mood of the\npoem? Use two details from the poem to support your response.\n36\nIn “At Dusk,” how does the shi that begins in line 21 affect the meaning of the poem? Use two\ndetails from the poem to support your response.\n37\nIn “At Dusk,” what do the speaker’s thoughts reveal about her ideas concerning home? Use two\ndetails from the poem to support your response.\n38\nExcerpt from\nMarine Mammals\nin Captivity\nby e Humane Society of the United States\ne public display industry captures many species of marine mammals from the\nwild, especially whales and dolphins. e Humane Society of the United States believes\nthat these animals should not be taken from the wild simply to entertain and amuse\npeople, for a number of reasons.\n1\nLife in the wild\ne very nature of these animals makes them uniquely unsuited to confinement.1 In\nthe wild, whales and dolphins live in large groups (called pods), oen in tight family\nunits. Family bonds oen last many years. In some species, they last for a lifetime.\n2\nWhales and dolphins travel long distances each day, sometimes swimming in a\nstraight line for a hundred miles, other times remaining in a certain area for hours or\ndays, moving several miles along a coastline and then turning to retrace their path.\nese marine mammals can dive up to several hundred meters and stay underwater for\nup to half an hour. ey spend only 10 to 20% of their time at the surface.\n3\ne sea is to whales and dolphins much as the air is to birds—a three-dimensional\nenvironment, where they can move up and down and side to side. But whales and\ndolphins don’t to perch. ey never come to shore, as do seals and sea lions.\nWhales and dolphins are always swimming, even when they “sleep.” ey are\n“voluntary breathers,” conscious of every breath they take. ey are always aware, and\nalways moving. Understanding this, it is difficult to imagine the tragedy of life in no\nmore than a tiny swimming pool.\n4\nLife in captivity\nLife for captive whales and dolphins is nothing like a life in the sea. It is almost\nimpossible to maintain a family group in captivity. Tanks only allow a few strokes in\nany direction before coming to a wall. Because tanks are shallow, the natural tendencies\n5\nRead this excerpt. _______________________\n1confinement: the state of being closed in or not free\nof whales and dolphins are reversed—they spend more than half their time at the\ntank’s surface.\nis unnatural situation can cause skin problems. In addition, in captive killer\nwhales (orcas), it is the probable cause of dorsal fin collapse, as without the support of\nwater, gravity pulls these tall appendages over as the whale matures. Collapsed fins are\nexperienced by all captive male orcas and many captive female orcas, who were either\ncaptured as juveniles or who were born in captivity. However, they are observed in only\nabout 1% of orcas in the wild.",
    "lexile_band": null,
    "word_count": 813,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2019-released-items-ela-g7.pdf",
    "grade": 7,
    "state": "NY",
    "created_at": "2025-12-31T15:18:41.540Z"
  },
  {
    "id": "fea3d6dd-9548-4c42-b657-1f67237e135c",
    "genre": "informational",
    "title": null,
    "text": "passage. You may need to review both the quotation and the passage in order to answer\nthe question correctly.\nExcerpt from\nRiver of Dreams\nby Hudson Talbott\nBy the twentieth century, New York City had long since reached its destiny of\nbecoming the most powerful city in America. In less than 300 years it had grown from\na tiny Dutch outpost in the wilderness to the business capital of the world. It was a city\nbuilt on dreams.\n1\nBut it was made out of bricks and cement that had come from the banks of the\nHudson. e river which had fed all those dreams was now fading into the background.\nNew York didn’t seem to need the river anymore, except as a sewer. And that’s what it\nbecame.",
    "lexile_band": null,
    "word_count": 129,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2019-released-items-ela-g8.pdf",
    "grade": 8,
    "state": "NY",
    "created_at": "2025-12-31T15:18:41.957Z"
  },
  {
    "id": "39b13403-d542-4a59-9c0c-f7d04088e30a",
    "genre": "informational",
    "title": null,
    "text": ".\nC People who benefit from the river must also protect it.\nD Opposing groups can each get what they want from the river.\nWhich sentence is most important to include in a summary of the article?\nA One company colored the river red and yellow with excess car paint.\nB e Hudson River became polluted in the effort to gain wealth.\nC e Mahicans have a saying about taking care of the river.\nD e author has dreamed of returning to the Hudson River for fiy years.\n18\n19\n20\nWhich quotation best expresses the author’s point of view in the article?\nA “In less than 300 years it had grown from a tiny Dutch outpost in the\nwilderness to the business capital of the world.” (paragraph 1)\nB\n“In 1963, Con Edison, New York City’s power company, proposed a plan\nfor constructing the largest hydroelectric pumping station ever built.”\n(paragraph 8)\nC “More and more people joined the movement as they realized how much\ndifference each of us can make.” (paragraph 12)\nD “It’s now my turn to help in keeping the river of dreams flowing, for all\nthose dreamers yet to come.” (paragraph 17)\n21\nExcerpt from\nA la Carte\nby Tanita S. Davis\n“Homework?” My mother mouths the word exaggeratedly, eyebrows raised, and I\nroll my eyes. Frowning, she points with her chin to the side door that leads to the stairs.\nI roll my eyes again, mouthing, Okay, okay, not needing her to pantomime further what\nshe wants me to do. I hate the thought of leaving the clattering nerve center of the\nrestaurant to wrestle with my trigonometry homework in my mother’s quiet office\ndownstairs.\n1\n“Order!”2\ne bright lights and swirl of noise and motion are muffled as the kitchen door\nswings closed behind me.\n3\nIt’s hard to remember a time when the restaurant hasn’t been the center of our lives.\nMom used to be a copy editor and wrote food features for our local paper, the\nClarion,\nand she met Pia when she did a write-up on the culinary school Pia attended. Pia\nthinks it was fate that Mom wanted to invest in a restaurant at the same time Pia\nwanted to buy the old bank building.\n4\nLa Salle Rouge doesn’t serve much in the way of “kid” food, since the menu doesn’t\ncater to people my age on a cheap date, but I’ve loved everything about it from the first.\nI started experimenting with being a vegetarian when I turned fourteen, but Pia still\nfound things to feed me and taught me to be creative with vegetables and tofu. I like to\nthink I’m the best-fed vegetarian in the state of California.\n5\nPia’s been really good about teaching what she knows, and I decided early on that\nthis is the work I want to do—get out of school and get into the kitchen for good. Mom\nand Pia have created a popular French-Asian-Californian fusion restaurant that has\ngotten great reviews from food critics. ey took the best of each other’s tastes—\nMom’s traditional Southern flavors and Pia’s French training combined with her\nvegetable- and spice-savvy Cambodian tastes—and pulled off what one food critic\ncalled “stylized food with unique flavor combinations in an intimate setting.”",
    "lexile_band": null,
    "word_count": 546,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2019-released-items-ela-g8.pdf",
    "grade": 8,
    "state": "NY",
    "created_at": "2025-12-31T15:18:41.957Z"
  },
  {
    "id": "810b00ef-29a9-4a76-84e8-18a8436dd05e",
    "genre": "poetry",
    "title": null,
    "text": "passage. You may need to review both the quotation and the passage in order to answer\nthe question correctly.\n– accurately and completely answer the questions being asked;\n– support your responses with examples or details from the text; and\n– write in complete sentences using correct spelling, grammar, capitalization,\nand punctuation.\nprovided, but do NOT write your final answer on this Planning Page. Writing on this\nPlanning Page will NOT count toward your final score. Write your final answer on the\nlined response pages provided.\n5\n10\n15\nSo Much Happiness\nby Naomi Shihab Nye\nIt is difficult to know what to do with so much happiness.\nWith sadness there is something to rub against,\na wound to tend with lotion and cloth.\nWhen the world falls in around you, you have pieces to pick up,\nsomething to hold in your hands, like ticket stubs or change.\nBut happiness floats.\nIt doesn’t need you to hold it down.\nIt doesn’t need anything.\nHappiness lands on the roof of the next house, singing,\nand disappears when it wants to.\nYou are happy either way.\nEven the fact that you once lived in a peaceful tree house\nand now live over a quarry of noise and dust\ncannot make you unhappy.\nEverything has a life of its own,\nit too could wake up filled with possibilities\nof coffee cake and ripe peaches,\nand love even the floor which needs to be swept,\nthe soiled linens and scratched records . . .\n25\nSince there is no place large enough\nto contain so much happiness,\nyou shrug, you raise your hands, and it flows out of you\ninto everything you touch. You are not responsible.\nYou take no credit, as the night sky takes no credit\nfor the moon, but continues to hold it, and share it,\nand in that way, be known.\nIn “So Much Happiness,” what does the comparison in lines 1 through 8 show about happiness?\nUse two details from the poem to support your response.\n36\nIn “So Much Happiness,” what do lines 15 through 19 say about how happiness affects the\nspeaker? Use two details from the poem to support your response.\n37\nWhat is a theme of “So Much Happiness?” Use two details from the poem to support your\nresponse.\n38\nExcerpt from\nGadgets: Built To Not Last\nby Mike Elgan\nOf course, everything ends up broken, obsolete and unusable at some point. e\ntrouble is, the companies that make our consumer electronics are deliberately or\ncarelessly decreasing the useful life of our gadgets so they can sell us another one\nsooner. . . .\n1\nI had a bulb burn out last week. Even though I had just bought that bulb about a year\nago, it died sooner than a bulb at a nearby fire station that was purchased in, and has\nbeen burning continuously since, 1901. ey don’t make ’em like that anymore.\nere’s no money in it.\n2\nDisposable dishes, “sporks,” razors, diapers and more—ours has become a\nthrowaway culture, even as the environment is being overwhelmed by trash. . . .\n3\nLow-end consumer printers, for example, are nearly impossible to sell second-hand\nand users are unlikely to bother getting them repaired, because you can always buy a\ngreat printer for less than $100. ey are just one of many types of devices that are far\ncheaper to replace than repair. Others include media players, DVD and Blu-ray players,\nclock radios and PC hard drives.\n4\nPeople used to upgrade their PCs with additional memory, new hard drives and even\nmotherboards. Now that laptops are far more commonly used as main PCs, we’ve\nallowed our upgrade impulse to atrophy.1\n5\nIf you could replace the battery, an iPad should last longer than that 111-year-old\nlight bulb. But because many devices are designed with irremovable batteries, we\nactually throw away gadgets more sophisticated than the computers that put men on\nthe moon—just because the battery dies. . . .\n6\nBut the bottom line is this: If we don’t buy it, they won’t make it. . . .7\nIt’s time to say, enough! Fellow gadget journalists, let’s put far greater emphasis on\ndurable, long-life design, and let’s slam manufacturers who engage in planned—or\nunplanned—obsolescence.2\n8\nRead this excerpt. _______________________\n1atrophy: decrease or \n2obsolescence: being no longer useful\nAnd fellow consumers, let’s buying devices designed to fail quickly, and let’s\ninsist that vendors make devices that can be repaired and upgraded.\n9\nIn “Excerpt from\nGadgets: Built To Not Last,” what does the phrase “throwaway culture” in\nparagraph 3 suggest about our society? Use two details from the excerpt to support your\nresponse.\n39\nWhat is the role of paragraph 7 in “Excerpt from\nGadgets: Built To Not Last”? Use two details\nfrom the excerpt to support your response.\n40\nis article is about a proposed Swedish law to lower the cost of repairing appliances. e\narticle asks whether repairs are the best solution to appliance problems.\nDon’t Fix Your Fridge, Just Buy a\nNew One\nby Michael Le Page\nIn general, if running a machine uses a lot more energy over the years than it takes\nto manufacture it, replacing it regularly may reduce energy consumption. Fridges, air\nconditioners, televisions and, yes, washing machines typically take far more energy to\nrun than to make.",
    "lexile_band": null,
    "word_count": 891,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2019-released-items-ela-g8.pdf",
    "grade": 8,
    "state": "NY",
    "created_at": "2025-12-31T15:18:41.957Z"
  },
  {
    "id": "4c3d8476-aa04-4c78-b7f1-3934a7c7a546",
    "genre": "literary",
    "title": null,
    "text": "passage. You may need to review both the quotation and the passage in order to answer\nthe question correctly.\nsummit in his space crawler. Luckily, he has brought along his mechanical wings.\nExcerpt from\nFly for Your Life\nby John Frizell\nAlan knew there was no way back to the base and no way the crew there could help\nhim remotely—the other crawler was down for maintenance. He could go down this\nside of the stream for 23 kilometers, to a flat area where the flowing liquid would\nspread out and be shallow enough to cross; then go back 23 kilometers to the far side of\nthe bridge. One problem: he would definitely run out of air before he got there.\n1\nen Alan thought of the folded flight wings he had attached to his suit. Could he fly\nacross the river and then walk to the base? Some quick calculations showed it wouldn’t\nwork. He had enough air, but the battery that powered the heater of the suit he wore to\nstay alive on Titan was only good for an hour, not the four-hour walk it would take to\nreach the base. Spacewalks were usually done trailing a power cable plugged in to the\nsuit. e cable carried power from the crawler to supplement the suit’s battery. Without\nthe supplemental power, he would freeze solid in 10 minutes once the battery was\nexhausted.\n2\nAlan knew flying the whole way was impossible. Even with Titan’s thick atmosphere\nand low gravity the suit made flying hard work, worse than running uphill carrying a\nsack of cement. No one could stay alo for more than 10 minutes. It would be at least a\nhalf-hour flight to the base.\n3\nHe needed more than wings alone to get back alive. en it came to him. Bolted to\nthe side of the crawler was a squat, black cylinder containing compressed nitrogen at\n200 bar, compressed Titanian atmosphere in fact, used for cleaning gunk off the\ncrawler’s treads. Alan struggled with the bolts, working carefully in the searing cold\nwith tools as brittle as glass. When he had the cylinder off, propped up, and pointing at\nthe sky, he put his wings on, and then took them off, repeating the task until he could\ndo it without thinking about it. . . .\n4\nmind, gave a sharp tug on a line that he had attached to the valve of the pressure\ncylinder. e cylinder hissed like a giant snake, as high-pressure nitrogen blasted out,\nand then shot into the sky. A length of climbing rope he had attached to it went taut\nand snatched him into the air, where he was buffeted and tossed by the jet of nitrogen\npouring down on him. It was like being caught under a breaking wave, pounded again\nand again by the surf. He was directly under the cylinder, using his weight and drag to\nkeep the nozzle pointed down as the cylinder loed him into Titan’s sky. e ground\nbeneath, blurred by the motion, made it impossible to gauge height or direction.\n5\nTime slowed; his shuddering world narrowed to the readout of the Titan Positioning\nSystem (TPS)—the icy moon’s equivalent of GPS. Gradually, the pounding lessened as\nthe rate of climb shown on the readout passed its peak and began falling. Alan waited.\nJust before it hit zero, he cut the rope. e cylinder, relieved of his drag, flew off,\ndwindling to a black dot and then disappearing into the empty sky above. Now he was\ncoasting upward, propelled by the momentum imparted to him by the nitrogen rocket.\nHe was high in the air, but already he was slowing under the drag of the thick\natmosphere. He had to get the wings on before the downward fall began. Once he\nstarted to move with some speed, he would begin to spin and never get them on. e\nfirst wing stuck and he had to take his arm out of the loops and try again. . . .\n6\nHe was gathering speed on his way down before he got the second one on. He spread\nhis wings and rolled into a comfortable position, soaring over the moon’s dimly lit\nsurface. e TPS showed that he was heading away from the base. He banked in an\neasy curve and settled on a course for home. All he had to do was hold the wings rigid\nand enjoy the ride. He took an occasional flap, just for fun. . . .\n7\nAs Alan glided toward the base, he flapped more oen, watching the height-above-\nsurface and distance-to-target displays. As they unwound, an unpleasant feeling, like a\ntrace of the frigid atmosphere outside, crept into his stomach. His elevation was\ndropping dangerously, with over three kilometers le to distance-to-target. He\ncould see details on the surface more clearly now, because he was flying so low. . . .\n8\nAlan forced himself to stay calm. Panic would mean disaster. He started flapping his\nwings faster, faster, faster. . . . He could feel himself liing with every beat of the\nmassive appendages. Faster, faster, faster. . . . His descent rate began to slow, but the\nmuscles in his arms burned with pain. . . .\n9\nTime stretched out endlessly.10\ne TPS buzzed loudly in his helmet. Target. e station’s beacon was directly below\nhim. He could barely feel his arms, but something made them flapping. He\ngratefully fell out of the sky, wrapped in a ball of pain, with barely the strength to flare\nhis wings one last time for a so landing. . . .\n11\nen he saw someone running toward him with a power cable in hand. Voices\nboomed into his helmet. It sounded like the whole station was in the control room\nwaiting to see if he had made it.\n12\n“Alan! ALAN! Say something! Can you move? Are you receiving this?” He\nrecognized the voice of the base leader. . . .\n13\nAs the crew lied him carefully onto a stretcher, he looked up at Titan’s hazy sky.\nI\nflew for my life today, he thought.\nI survived. at’s the only record that matters.\n14\nParagraphs 1 through 4 reveal that Alan is\nA discouraged aer several of his ideas fail\nB overwhelmed and dismayed by his environment\nC adventurous and enjoying the current challenge\nD focused even in a life and death situation\nIn paragraph 4, what is the effect of the simile “with tools as brittle as glass”?\nA It affects the plot by explaining that the tools were hard to see.\nB It creates suspense by showing that the tools were missing some pieces.\nC It adds to the setting by suggesting that the tools were reflecting light off the\nsnow.\nD It increases danger by emphasizing that the tools were breakable in the cold.\nWhy does Alan use the compressed nitrogen?\nA e nitrogen’s energy will propel him toward the base before he runs out of\nair.\nB e nitrogen is used for emergencies when astronauts become stranded.\nC e nitrogen will stay liquid in the atmosphere.\nD e nitrogen’s cable can be cut and it will continue to work.\n1\n2\n3\nWhat quotation best reveals Alan’s character?\nA “As Alan glided toward the base, he flapped more oen, watching the\nheight-above-surface and distance-to-target displays.” (paragraph 8)\nB “He could see details on the surface more clearly now, because he was flying\nso low.” (paragraph 8)\nC “Alan forced himself to stay calm. Panic would mean disaster.”\n(paragraph 9)\nD “His descent rate began to slow, but the muscles in his arms burned with\npain.” (paragraph 9)\nIn paragraph 9, “appendages” refers to something that\nA calms a person\nB is attached\nC slows things down\nD is lightweight\ne main way the point of view affects the story is by making it\nA formal\nB lighthearted\nC humorous\nD suspenseful\n4\n5\n6\nWhich sentence would be most important to include in a summary of the story?\nA A cable connects space suits to a power source for spacewalks.\nB e power from the nitrogen blast allows Alan to travel farther and faster.\nC Alan soars away from his target during part of his flight.\nD e weather on Titan is cold and hazy.\n7\nis excerpt is from a book about the history of the Hudson River.\nExcerpt from\nRiver of Dreams\nby Hudson Talbott\nBy the twentieth century, New York City had long since reached its destiny of\nbecoming the most powerful city in America. In less than 300 years it had grown from\na tiny Dutch outpost in the wilderness to the business capital of the world. It was a city\nbuilt on dreams.\n1\nBut it was made out of bricks and cement that had come from the banks of the\nHudson. e river which had fed all those dreams was now fading into the background.\nNew York didn’t seem to need the river anymore, except as a sewer. And that’s what it\nbecame.",
    "lexile_band": null,
    "word_count": 1516,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2021-released-items-ela-g8.pdf",
    "grade": 8,
    "state": "NY",
    "created_at": "2025-12-31T15:18:42.710Z"
  },
  {
    "id": "6f0490bd-4efd-4fac-afc0-76aa8fe3ecf5",
    "genre": "informational",
    "title": null,
    "text": ".\nC People who benefit from the river must also protect it.\nD Opposing groups can each get what they want from the river.\nWhich sentence is most important to include in a summary of the article?\nA One company colored the river red and yellow with excess car paint.\nB e Hudson River became polluted in the effort to gain wealth.\nC e Mahicans have a saying about taking care of the river.\nD e author has dreamed of returning to the Hudson River for fiy years.\n11\n12\n13\nWhich quotation best expresses the author’s point of view in the article?\nA “In less than 300 years it had grown from a tiny Dutch outpost in the\nwilderness to the business capital of the world.” (paragraph 1)\nB\n“In 1963, Con Edison, New York City’s power company, proposed a plan\nfor constructing the largest hydroelectric pumping station ever built.”\n(paragraph 8)\nC “More and more people joined the movement as they realized how much\ndifference each of us can make.” (paragraph 12)\nD “It’s now my turn to help in keeping the river of dreams flowing, for all\nthose dreamers yet to come.” (paragraph 17)\n14\nExcerpt from\nA la Carte\nby Tanita S. Davis\n“Homework?” My mother mouths the word exaggeratedly, eyebrows raised, and I\nroll my eyes. Frowning, she points with her chin to the side door that leads to the stairs.\nI roll my eyes again, mouthing, Okay, okay, not needing her to pantomime further what\nshe wants me to do. I hate the thought of leaving the clattering nerve center of the\nrestaurant to wrestle with my trigonometry homework in my mother’s quiet office\ndownstairs.\n1\n“Order!”2\ne bright lights and swirl of noise and motion are muffled as the kitchen door\nswings closed behind me.\n3\nIt’s hard to remember a time when the restaurant hasn’t been the center of our lives.\nMom used to be a copy editor and wrote food features for our local paper, the\nClarion,\nand she met Pia when she did a write-up on the culinary school Pia attended. Pia\nthinks it was fate that Mom wanted to invest in a restaurant at the same time Pia\nwanted to buy the old bank building.\n4\nLa Salle Rouge doesn’t serve much in the way of “kid” food, since the menu doesn’t\ncater to people my age on a cheap date, but I’ve loved everything about it from the first.\nI started experimenting with being a vegetarian when I turned fourteen, but Pia still\nfound things to feed me and taught me to be creative with vegetables and tofu. I like to\nthink I’m the best-fed vegetarian in the state of California.\n5\nPia’s been really good about teaching what she knows, and I decided early on that\nthis is the work I want to do—get out of school and get into the kitchen for good. Mom\nand Pia have created a popular French-Asian-Californian fusion restaurant that has\ngotten great reviews from food critics. ey took the best of each other’s tastes—\nMom’s traditional Southern flavors and Pia’s French training combined with her\nvegetable- and spice-savvy Cambodian tastes—and pulled off what one food critic\ncalled “stylized food with unique flavor combinations in an intimate setting.”",
    "lexile_band": null,
    "word_count": 546,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2021-released-items-ela-g8.pdf",
    "grade": 8,
    "state": "NY",
    "created_at": "2025-12-31T15:18:42.710Z"
  },
  {
    "id": "c845da10-0894-4b78-8d8e-08cc77624f2b",
    "genre": "drama",
    "title": "The Call of Coney Island",
    "text": "via\nCopyright Clearance Center.\nExcerpt from “The Call of Coney Island” by Cynthia Overbeck Bix, Cobblestone, July 1, 2015. \nUsed with permission of Carus Publishing Company via Copyright Clearance Center.\nDeveloped and published under contract with the New York State Education Department by Questar Assessment Inc., 5550 Upper 147th\nStreet West, Minneapolis, MN 55124. \nEExxcceerrpptt ffrroomm ““ee BBeeaaddwwoorrkk”” ffrroommAAmmeerriiccaann IInnddiiaann SSttoorriieess\nby Zitkala-Sa\nSoon aer breakfast mother sometimes began her beadwork. On a bright, clear day,\nshe pulled out the wooden pegs that pinned the skirt of our wigwam to the ground, and\nrolled the canvas part way up on its frame of slender poles. en the cool morning\nbreezes swept freely through our dwelling, now and then waing the perfume of sweet\ngrasses from the newly burnt prairie.\n1\nUntying the long tasseled strings that bound a small brown buckskin bag, my\nmother spread upon a mat beside her bunches of colored beads, just as an artist\narranges the paints upon his palette. On a lapboard she smoothed out a double sheet of\nso white buckskin; and drawing from a beaded case that hung on the le of her wide\nbelt a long, narrow blade, she trimmed the buckskin into shape. Oen she worked\nupon small moccasins for her small daughter. en I became intensely interested in her\ndesigning. With a proud, beaming face, I watched her work. In imagination, I saw\nmyself walking in a new pair of snugly fitting moccasins. I felt the envious eyes of my\nplaymates upon the pretty red beads decorating my feet.\n2\nClose beside my mother I sat on a rug, with a scrap of buckskin in one hand and an\nawl in the other. is was the beginning of my practical observation lessons in the art\nof beadwork. From a skein of finely twisted threads of silvery sinews my mother pulled\nout a single one. With an awl she pierced the buckskin, and skillfully threaded it with\nthe white sinew. Picking up the tiny beads one by one, she strung them with the point\nof her thread, always twisting it carefully aer every stitch. . . .\n3\nAlways aer these confining lessons I was wild with surplus spirits, and found\njoyous relief in running loose in the open again. Many a summer aernoon a party of\nfour or five of my playmates roamed over the hills with me. We each carried a light,\nsharpened rod about four feet long, with which we pried up certain sweet roots. When\nwe had eaten all the choice roots we chanced upon, we shouldered our rods and strayed\noff into patches of a stalky plant under whose yellow blossoms we found little crystal\n4\ncould boast of a lump the size of a small bird’s egg. Soon satiated11 with its woody\nflavor, we tossed away our gum, to return again to the sweet roots.\nI remember well how we used to exchange our necklaces, beaded belts, and\nsometimes even our moccasins. We pretended to offer them as gis to one another. We\ndelighted in impersonating our own mothers. We talked of things we had heard them\nsay in their conversations. We imitated their various manners, even to the inflection of\ntheir voices. In the lap of the prairie we seated ourselves upon our feet, and leaning our\npainted cheeks in the palms of our hands, we rested our elbows on our knees, and bent\nforward as old women were most accustomed to do.\n5\nWhile one was telling of some heroic deed recently done by a near relative, the rest\nof us listened attentively, and exclaimed in undertones “Han! han!” (yes! yes!) whenever\nthe speaker paused for breath, or sometimes for our sympathy. As the discourse\nbecame more thrilling, according to our ideas, we raised our voices in these\ninterjections. In these impersonations our parents were led to say only those things that\nwere in common favor.\n6\nNo matter how exciting a tale we might be rehearsing, the mere shiing of a cloud\nshadow in the landscape near by was sufficient to change our impulses; and soon we\nwere all chasing the great shadows that played among the hills. We shouted and\nwhooped in the chase; laughing and calling to one another, we were like little\nsportive nymphs22 on that Dakota sea of rolling green.\n7\nOn one occasion I forgot the cloud shadow in a strange notion to catch up with my\nown shadow. Standing straight and still, I began to glide aer it, putting out one foot\ncautiously. When, with the greatest care, I set my foot in advance of myself, my shadow\ncrept onward too. en again I tried it; this time with the other foot. Still again my\nshadow escaped me. I began to run; and away flew my shadow, always just a step\nbeyond me. Faster and faster I ran, setting my teeth and clenching my fists, determined\nto overtake my own fleet shadow. But ever swier it glided before me while I was\ngrowing breathless and hot. Slackening my speed, I was greatly vexed that my shadow\nshould check its pace also. Daring it to the utmost, as I thought, I sat down upon a rock\nimbedded in the hillside.\n8\nSo! my shadow had the impudence33 to sit down beside me!9\nNow my comrades caught up with me, and began to ask why I was running away so\nfast.\n10\n_______________________\n11ssaattiiaatteedd:: completely satisfied\n22ssppoorrttiivvee nnyymmpphhss:: playful creatures of the woods\n33iimmppuuddeennccee:: nerve\n“Oh, I was chasing my shadow! Didn’t you ever do that?” I inquired, surprised that\nthey should not understand.\n11\ney planted their moccasined feet firmly upon my shadow to stay it, and I arose.\nAgain my shadow slipped away, and moved as oen as I did. en we gave up trying to\ncatch my shadow.\n12\nBefore this peculiar experience, I have no distinct memory of having recognized any\nvital bond between myself and my shadow. I never gave it an aerthought.\n13\nReturning to our borrowed belts and trinkets, we rambled homeward. at evening,\nas on other evenings, I went to sleep over my legends.\n14\nWhich detail bbeesstt reflects the narrator’s point of view of her mother and her beadwork?\nA comparing the mother to an artist arranging paints upon a palette\nB describing the mother drawing a blade to trim the buckskin\nC mentioning the mother making moccasins for her daughter\nD describing the mother picking up the tiny beads one at a time\nWhat similarity is shared between the events in paragraph 3 and the events in paragraph 4?\nA Both paragraphs emphasize the value of honoring family traditions.\nB Both paragraphs describe the ability to use tools with precision.\nC Both paragraphs demonstrate how teachers inspire others.\nD Both paragraphs highlight the joys of friendship and play.\ne central idea of paragraph 4 is\nA children enjoy eating sweet things\nB the narrator is a leader among her friends\nC children are able to make their own fun\nD the setting has many natural resources\n8\n9\n10\nWhat does the narrator’s frequent use of the word “we” in paragraphs 4 and 5 suggest?\nA youthfulness\nB dependence\nC companionship\nD remembrance\nWhat is the meaning of “discourse” as used in paragraph 6?\nA brief remark\nB spoken story\nC response to someone\nD disagreement between people\nHow do paragraphs 8 and 9 contrast with the paragraphs right before and aer them?\nA ey provide a look at the narrator’s imagination.\nB ey demonstrate the narrator’s desire for independence.\nC ey emphasize the narrator’s physical abilities.\nD ey focus attention on the narrator’s selfish nature.\n11\n12\n13\nWhich sentence bbeesstt expresses a central idea of the passage?\nA e narrator is interested in her mother’s beadwork on small moccasins.\nB Aer beadwork lessons with her mother, the narrator loves to\nplay outdoors.\nC e narrator’s friends try to help her catch her shadow while playing.\nD When running through the fields, the narrator and her friends make lots\nof noise.\n14\nis story takes place in Japan. e narrator has just rented a new home on a small street\nnamed Lightning Alley.\nEExxcceerrpptt ffrroomm\nee GGuueesstt CCaatt\nby Takashi Hiraide\ne cat’s name was Chibi, which means “little one.” We could hear the boy’s\nparticularly high-pitched voice calling the cat: “Chibi!” en we’d hear the sound of\nthe boy’s shoes running around outside, followed by the tinkling of the little bell\nannouncing the cat’s arrival.\n1\nChibi was a jewel of a cat. Her pure white fur was mottled with several lampblack\nblotches containing just a bit of light brown. e sort of cat you might see just about\nanywhere in Japan, except she was especially slim and tiny.\n2\nese were her individual characteristics—slim and small, with ears that stood out,\ntapering off beautifully at the tips, and oen twitching. She would approach silently and\nundetected to rub up against one’s legs. At first I thought Chibi avoided me because I\nwas not used to cats, but this seems not to have been the case. When a girl who oen\npassed along Lightning Alley ped and crouched to gaze at the cat, it did not run\naway. But as soon as she attempted to touch it, the cat quickly slipped off, avoiding\ncontact at all costs. e cat’s manner of rejection was like cold, white light.\n3\nMoreover, the cat rarely made a sound. As far as I remember, when it first appeared\nin the alley it made some sort of sound, but since then it had never let out a meow. It\nlooked as if no matter how much time passed the cat was not going to let us hear its\nvoice. is seemed to be the message the cat was giving us.\n4\nAnother one of Chibi’s characteristics was that she changed the direction of her\ncautious attention frequently. is active behavior wasn’t limited to her\nkittenhood. Perhaps because she played alone most of the time in the expansive garden,\nshe reacted strongly to insects and reptiles. And there were times when I could only\nconclude that she must be reacting to subtle changes in the wind and light, not\ndetectable by humans. It may be that most cats share the same quickness, but even so,\nin Chibi’s case, it was acute—she was, aer all, the cat of Lightning Alley. My wife got\ninto the habit of pointing to the cat whenever it went by, extolling11 its virtues. . . .\n5\n11eexxttoolllliinngg:: praising\n22ttaalliissmmaann:: an object thought to bring good luck\n33uubbiiqquuiittoouuss:: present everywhere\nChibi, who loved to play ball, gradually began to visit us on her own and would try\nand get us to play with her. She would step gingerly into the room and gaze intently at\nits occupants, then purposefully turn around and walk back out, as if to lead us to the\ngarden. is process would be repeated until she got a response. Most of the time my\nwife would put down whatever she was doing, slip happily into her sandals and head\noutside.\n6\nHaving played to her heart’s content, Chibi would come inside and rest for a while.\nWhen she began to sleep on the sofa—like a talisman 22 curled gently in the shape of a\ncomma and dug up from a prehistoric archaeological site—a deep sense of happiness\narrived, as if the house itself had dreamed this scene.\n7\nAvoiding the prying eyes of the landlady, we began leaving it up to Chibi to come\ninside the house whenever she wanted—and with this new development I had begun\nlittle by little to understand cat lovers. Whether on TV or in all of the ubiquitous33 cat\ncalendars, it seemed as if there was no cat comparable to her. But, though I had started\nto think of her as the best cat around, she was not really our cat.\n8\nFirst we would hear the tinkling of the bell, and then she would appear, so we began\nto call her by the nickname “Tinkerbell.” Whenever we wanted her to come over, this\nname seemed to find itself on our lips.\n9\n“I wonder where Tinkerbell is.” By the time my wife had gotten the words out of her\nmouth we’d hear the tinkling of Chibi’s bell. We’d realize that she was near at the point\nwhere, exiting the foyer next door (located at the second corner of Lightning Alley),\nChibi would leap through the tear in the wire-mesh boundary of the property, dash\nalong the side of the building, turn at the far end of the veranda, leap up onto the open\narea of the deck, and then, placing her front paws on the window frame at about the\nheight of a human adult’s knee, stretch out her neck to peek inside.",
    "lexile_band": "1130L",
    "word_count": 2145,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2022-released-items-ela-g8.pdf",
    "grade": 8,
    "state": "NY",
    "created_at": "2025-12-31T15:18:43.429Z"
  },
  {
    "id": "e1a58f8f-04bd-43ee-80aa-03364eea4669",
    "genre": "informational",
    "title": null,
    "text": "passage. You may need to review both the quotation and the passage in order to answer\nthe question correctly.\n– accurately and completely answer the questions being asked;\n– support your responses with examples or details from the text; and\n– write in complete sentences using correct spelling, grammar, capitalization,\nand punctuation.\nprovided, but do NOT write your final answer on this Planning Page. Writing on this\nPlanning Page will NOT count toward your final score. Write your final answer on the\nlined response pages provided.\nElaine Reese is a professor of psychology and the author of a book about telling stories.\nEExxcceerrpptt ffrroomm\nWWhhaatt KKiiddss LLeeaarrnn FFrroomm\nHHeeaarriinngg FFaammiillyy SSttoorriieess\nby Elaine Reese\n“Dad, tell me a story from when you were little. Tell me the story about the time you\nmet your best friend Chris at school.” Six-year-old Alex, who has just started school\nhimself, snuggles into his pillow and catches his dad’s hand in the dark. ey have\nfinished the nightly reading of\nTin Tin and now it’s time for “just one more story”\nbefore Alex goes to sleep.\n1\nMost parents know about the benefits of reading stories from books with their\nyoung children. Parents are blasted with this message in pediatricians’ offices, at\npreschool, on TV, even with billboards on the city bus. Reading books with children on\na daily basis advances their language skills, extends their learning about the world, and\nhelps their own reading later in school. Reading with your child from a young age can\ninstill a lifelong love of books. A new study published in\nScience even shows that\nreading literary fiction improves adults’ ability to understand other people’s emotions.",
    "lexile_band": null,
    "word_count": 279,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2022-released-items-ela-g8.pdf",
    "grade": 8,
    "state": "NY",
    "created_at": "2025-12-31T15:18:43.429Z"
  },
  {
    "id": "fe2cfb70-ba1c-4146-ad8c-49eb92a71a56",
    "genre": "drama",
    "title": null,
    "text": "to \n– completely answer the questions being asked;\n– support your responses with examples or details from the text; and\n– write in complete sentences using correct spelling, grammar, capitalization,\nand punctuation.\nprovided, but do NOT write your final answer on this Planning Page. Writing on this\nPlanning Page will NOT count toward your final score. Write your final answer on the\nlined response pages provided.\nMom, Josh, and the narrator are upset because Dad has le for a while.\nExcerpt from Inevitable and Only\nby Lisa Rosinsky\nWhen we ped at the grocery store, Mom said she wanted comfort food,\nsomething warm and filling. I wished I knew how to make vegetarian paella and\nchocolate-dipped churros, the special treats my abuelita made for us whenever we visited\nMom’s parents down in Florida. But that wasn’t what I was craving, anyhow. So I sent\nMom to get flour and sugar while Josh and I filled the cart with cottage cheese, eggs,\napples, and raisins. Ingredients for Cottage Cheese Contraption—one of the holdovers\nfrom our days at Ahimsa House. Everyone took turns cooking, so some nights we had\ngourmet Indian stir-fry or fancy Italian pasta dishes, and other nights we had\nunidentifiable casseroles made with cream of mushroom soup from a can.\n1\nOr Cottage Cheese Contraption, invented by an old woman everyone called Granny.\nShe’d been a housewife in Arkansas for fiy years, and when her husband died, she packed\nall her essential belongings into one suitcase, sold everything else, and took off on a road\ntrip across the country. A year later, she landed in Takoma Park, at Ahimsa House. She’d\nlived there ever since, grandmothering every lost and lonely kid who came through.\n2\nJosh was two when we le Ahimsa House, too young to remember anything about it.\nBut he loved hearing stories about the people who lived there. About the days when Dad\nwas a grad student in Renaissance literature and drama at Georgetown, when Mom served\nchai lattes at the Sunflower Café and played jazz piano at fancy DC nightclubs on the\nweekends. I’d shown Josh pictures of Mom in a tiny black dress at one of her gigs, a choker\nof pearls around her throat. She was unrecognizable, her eyes outlined in smoky makeup,\nher long hair loose down her back, a white rose tucked behind her ear. . . .\n3\nWhen Josh was five, he discovered the cello. It happened at the Baltimore Symphony\nOrchestra. Mom was excited because it was an all-Haydn program—the “Farewell”\nSymphony and a cello concerto. Mom’s always said, Haydn is the underappreciated Einstein\nof the music world. Whenever she was upset or stressed in those days, she sat down at the\npiano and took out her big tattered book of Haydn sonatas, held together with a rubber\nband, loose pages sticking out everywhere. Now she hardly ever has time to play the\npiano, and all her music sits neatly stacked in milk crates along the wall.\n4\n1\nrock : object used to keep a cello in place while it is being played\nI remember the “Farewell” Symphony, how at the end the musicians all got up, one by\none, switched off their stand lights, and walked off into the wings, until there were just two\nlonely violinists still playing by themselves. And I remember the cello soloist, his wild\ncurly hair flopping all over the place like a lion’s mane while he played, the way he made\nthe cello sound like it was singing. But mostly I remember Josh, sitting there with his lips\nparted, as if he were getting ready to take a bite of ice cream but forgot what he was doing\nand froze in place. When it was over and the cellist took his final bow and le the stage,\nJosh burst into tears and wailed, “Make the cello man come back!” Mom and Dad were\nshocked. Josh barely ever complained or whined or asked for anything. e next day,\nMom signed him up for cello lessons at the Prep.\n5\ninking about all this while I unpacked the Cottage Cheese Contraption ingredients\non the kitchen counter, I had an idea. “Josh, why don’t you play me some cooking music?”\n6\nDad always used to tell me to play “cooking music” on my violin when I wanted to\nhelp him with dinner but was too young to be much use. I suspect it was also a sneaky way\nof getting me to practice, even for only ten or fieen minutes. I never had the discipline\nJosh seemed to be born with.\n7\nJosh had wilted a little when we walked into the empty house, but brightened up at\nmy suggestion. He ran upstairs and came down slowly, carrying his cello with both hands,\nhis rock 1 slung over one shoulder. He settled himself on one of the chairs at the\nkitchen table and started playing movements from the Bach cello suites from memory.\n8\nI cracked eggs, stirred cottage cheese and flour and sugar together, chopped apples,\ntossed in raisins, and fried it all into a delicious hot mush, while Josh “talked” to me. at’s\nhow I thought of it—this was Josh’s way of saying the things he didn’t know how to express\nin words.\n9\nHow does paragraph 4 develop a theme in the story?\nA by identifying the mother’s opinion about Haydn\nB by describing the crates where the mother keeps her music\nC by showing the value of music in the mother’s life\nD by explaining the importance of the concert for the mother\nWhich quotation shows a change in the direction of the story?\nA “. . . she landed in Takoma Park, at Ahimsa House.” (paragraph 2)\nB “But he loved hearing stories about the people who lived there.” (paragraph 3)\nC “When Josh was five, he discovered the cello.” (paragraph 4)\nD “e next day, Mom signed him up for cello lessons . . .” (paragraph 5)\nIn paragraph 6, how does the narrator’s question to Josh affect the resolution of the story?\nA by giving Josh an opportunity to express his feelings\nB by letting the narrator share a memory with her brother\nC by revealing how Josh has grown in his ability to play the cello\nD by allowing the narrator to make dinner while her brother is occupied\n29\n30\n31\nIn paragraph 8, the word “wilted” most likely means that Josh is\nA confused\nB frustrated\nC sad\nD tired\nPeople oen use food as a way to create a sense of community. Which phrase from the story best\nsupports this idea?\nA “Everyone took turns cooking” (paragraph 1)\nB “Cottage Cheese Contraption, invented by an old woman” (paragraph 2)\nC “when Mom served chai lattes at the Sunflower Café” (paragraph 3)\nD “fried it all into a delicious hot mush, while Josh ‘talked’ to me” (paragraph 9)\nIn paragraph 9, why is the word “talked” in quotation marks?\nA Josh does not wish to have a discussion with the narrator.\nB Josh communicates with the narrator by using the cello as his voice.\nC Josh only pretends to communicate with the narrator.\nD Josh does not want the narrator to share his feelings with their mother.\n32\n33\n34\nHow does the author best develop the narrator’s point of view in the story?\nA by sharing the narrator’s memories\nB by describing the narrator’s opinions\nC through the narrator’s reactions to events\nD through the narrator’s dialogue\n35\ne Advice of a Little Girl: Lincoln\nExhibition Confirms a Family Myth\nby Gail Fineberg\nWhen Elizabeth “Liz” Bedell, a 23-year-old staff member in the U.S. House of\nRepresentatives, was growing up in Medford, Mass., she dismissed as “family myth” a\nstory her grandfather oen told about his Aunt Grace Bedell. He claimed she wrote to Abe\nLincoln when she was a little girl and received a letter in return.\n1\n“My grandfather used to tell us we had a footnote in history,” Liz Bedell explained.\n“We were a working-class family. To impress people, he’d say, ‘Oh, we are descendants of\nGrace Bedell. When she was a little girl she wrote to Abe Lincoln and suggested he grow a\nbeard so he could win the election.’\n2\n“I didn’t believe him,” Liz Bedell said. “None of us did.”3\nImagine her surprise this spring as she was browsing through the Library’s Lincoln\nbicentennial exhibition, “With Malice Toward None,”1 and happened upon a case\ncontaining two short, handwritten letters, one dated Oct. 15, 1860, addressed to Hon.2\nA.B. Lincoln and signed by Grace Bedell, the other dated Oct. 19, 1860, addressed to “My\ndear little Miss” and signed A. Lincoln.\n4\n“I almost died,” Bedell said. “I called my father. He said, ‘Are you serious? My father\nwas telling the truth all this time.’ ”\n5\nShe wrote in the Library’s exhibition visitors’ log: “I cried my eyes out when I saw the\nletter from Grace Bedell to Abe Lincoln—she’s my great-great aunt, and I grew up with the\nstory not really believing it. Elizabeth Bedell.”\n6\n“I felt very emotional,” Bedell said later. “I wished I could call my grandfather\n(Kenneth Bedell, who in 2005 died at age 95) and say ‘You were right.’ ”\n7\nHer grandfather encouraged her to pursue a lifelong interest in politics. “In fih\ngrade, I wanted to be president of the United States. In the eighth grade, I wanted to be a\nSupreme Court justice. en I wanted to be president again,” she said.\n8\n“Grandpa used to tell me, ‘You can do anything you want. You can be president. Why,\njust look at your great-great aunt Grace Bedell. She couldn’t vote, but she put pen to\npaper.’ ”\n9",
    "lexile_band": null,
    "word_count": 1631,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2023-released-items-ela-g7.pdf",
    "grade": 7,
    "state": "NY",
    "created_at": "2025-12-31T15:18:43.816Z"
  },
  {
    "id": "46f6ceab-a072-427c-946f-4affd52e7acc",
    "genre": "informational",
    "title": null,
    "text": "to \n– completely answer the questions being asked;\n– support your responses with examples or details from the text; and\n– write in complete sentences using correct spelling, grammar, capitalization,\nand punctuation.\nIn this historical fiction, Margaret Bourke-White, an early female photographer, is still\nin college. e year is 1927.\nExcerpt from Girl with a Camera:\nMargaret Bourke-White,\nPhotographer\nby Carolyn Meyer\nMy exams went fairly well, and my grades were satisfactory if not stellar.1 In my final\nsemester I signed up for a journalism course. Other students in the class were hoping to\nbecome newspaper reporters; I was more interested in magazine work and submitted a\nphoto-essay—pictures of doorways with very little text—for an assignment. e professor\nwas the advisor for the Cornell Alumni2 News, and he thought the editor might want to\nfeature my photographs of campus buildings. e editor looked them over and paid me\nfive dollars each for three pictures. It seemed like a fortune! When the magazine came out,\nseveral graduates of the department of architecture wrote to praise the pictures, and one\nalumnus suggested that I specialize in architectural photography. He said my pictures were\nthat good. It was the encouragement I craved.\n1\nBut I wasn’t sure that with no professional experience I could actually land such a job\n—and I did need to find work. To play it safe, I sent an application to the American\nMuseum of Natural History in New York. e curator of herpetology3 invited me to come\nfor an interview. He seemed so impressed by my application that I thought the offer of a\nposition might be imminent.4\n2\nI was nearly twenty-two, about to graduate, and unsure which to follow—my head\nand my long interest in natural science, or my heart and my passion for photography. A\njob at the museum would be the safe choice. Or I could try to pursue a career in\narchitectural photography, even though I had no specific training in the field. I had to\nknow if the men who praised my photographs were right, or if they simply enjoyed my\npictures of their alma mater.5 My future hung in the balance.\n3\nI asked the letter-writer to recommend someone qualified to give me an objective\nopinion. His reply: “See Benjamin Moskowitz, York & Sawyer, Architects, NYC. Good\nluck.”\n4\nCity, where I arrived late on ursday and went straight to the Park Avenue address of\nYork & Sawyer. At their office on the twenty-third floor I asked the switchboard operator\nfor Mr. Moskowitz.\n5\n“I think Mr. Moskowitz has already le, miss. I know he was planning a long\nweekend. Did you have an appointment?” . . .\n6\nShe sighed and asked my name and told me to wait while she tried to see if he might\nstill be there. I paced nervously, thinking that my time and money and my best chance for\nan expert opinion had been thrown away. e operator rang his office; no answer. “Sorry,\nbut it looks like you’re out of luck, Miss White,” she said.",
    "lexile_band": null,
    "word_count": 511,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2023-released-items-ela-g8.pdf",
    "grade": 8,
    "state": "NY",
    "created_at": "2025-12-31T15:18:44.227Z"
  },
  {
    "id": "25e1816d-2c95-44ba-90a9-e49f90bbcc5f",
    "genre": "drama",
    "title": "Robotic Fish to Keep a Fishy Eye on the\nHealth of the Oceans",
    "text": "to \n– completely answer the questions being asked;\n– support your responses with examples or details from the text; and\n– write in complete sentences using correct spelling, grammar, capitalization,\nand punctuation.\nprovided, but do NOT write your final answer on this Planning Page. Writing on this\nPlanning Page will NOT count toward your final score. Write your final answer on the\nlined response pages provided.\nIn a faraway kingdom called Tellus, Aleks signs up for the army. en he finds out what\na dishonest and brutal place it is.\nExcerpt from e Almost King\nby Lucy Saxon\nSlinging his light saddlebag over his shoulders and swallowing his cry of pain at the\nmovement, he pulled his hat low over his forehead and made for the door. He needed his\nenlistment forms from Shulga’s office; if he could find and destroy them, the army would\nhave no record of him enlisting. Even if he did get caught aer escaping—provided he\nescaped in the first place—there would be no proof that he was a cadet.1 en all he had to\ndo was reach the stables and get Quicksilver before anyone on the dinner shi noticed\nwhat he was doing. Aer that . . . he would find a way out. ere had to be one\nsomewhere. . . .\n1\nere were no guards at the door; the barracks2 was down to a skeleton guard for the\ndinner shi. Aleks silently retraced his steps from earlier in the day, making his way\ntowards Antova’s office. His eyes raced over every door’s nameplate, frowning when none\nof them was the office he was looking for. He was incredibly short on time; he had to be on\nQuicksilver and heading for freedom before dinner ended.\n2\nFinally, he saw it. Lt. Shulga was embossed on a nameplate three doors down from\nAntova’s. Luckily, the door was unlocked and the room empty; Shulga had obviously gone\nstraight from the time-out room to dinner. e office was decorated in the same way as\nAntova’s, in blue and dark brown, with a large map of Tellus on the wall instead of the\nroyal crest the commander displayed. Darting across to a metal filing cabinet that took up\nmost of one wall, Aleks wrenched open a drawer at random, ignoring the searing ache in\nhis arms. Again, unlocked. Clearly Shulga was too cocky to think anyone would dare\nsnoop around his office.\n3\ne drawer was full of neatly filed enlistment forms in alphabetical order; F–J. Aleks’s\nform would come under V. Shutting the drawer, he reached for the next one, perplexed to\nfind it containing M–P. e drawer aer that didn’t contain enlistment forms at all, but\ninstead held a large stack of account books. Shulga didn’t seem to have any sort of system\nwhatsoever; how did he ever find anything he needed?\n4\nthrough stacks of papers and leather-bound books, his desperation growing with every\nunsuccessful attempt. Digging through a drawer of miscellaneous files and books closest\nto the desk, his fingers scrabbled at the bottom of the drawer and it tilted a fraction,\nsending three stacked files slumping against a small metal box. ‘What the . . .’ He trailed\noff, pressing harder on the base of the drawer, watching it dip under his fingers. e\ndrawer had a false bottom!\n5\nAleks glanced at the clock; he knew he shouldn’t, but he’d always been the curious\ntype. Emptying the drawer, he dug his nails under one side of the fake bottom, prising it\nup. e secret compartment was fairly narrow, containing only a thin file of papers and a\nbattered leather journal. It was the journal that caught Aleks’s eye, for it had the Anglyan\ncrest embossed in one corner of the cover. What on Tellus was Shulga doing with an\nAnglyan journal? . . .\n6\nA door slamming somewhere in the building startled him out of his horrified trance,\nand a quick look at the clock nearly gave Aleks a heart attack. He barely had ten minutes\nuntil the end of dinner!\n7\nStuffing the journal in an inner pocket of his coat, he hastily replaced the drawer’s\nfalse bottom and contents, shutting it as quietly as he could. Tugging on the two drawers\nhe had yet to check, he swore under his breath. Neither of them contained a V section,\nand Aleks felt dread creep over him at the realization that his file was likely elsewhere. He\ndidn’t have the time to search any other rooms. Out of options, he straightened up,\nshoving all the cabinet drawers shut and sprinting for the door.\n8\nA quick glance through the glass panel showed the corridor to be empty, so Aleks\nslipped from the room.\n9\nBursting through the door of the building, he turned for the stables, slowing his pace\nonce he hit the cobblestone path, just in case anyone happened to look his way. ere was\nnothing more suspicious than a lone cadet running.\n10\nWhile there was supposed to be at least one stablehand in the building at all times,\nAleks couldn’t see a single soul in the stables. Perfect. Hurrying to the tack3 room, he\neasily found Quicksilver’s saddle and bridle, though carrying the heavy items in his\ncurrent state nearly sent him crumpling to the floor. Still, he forced himself to ignore the\npain, heing the tack across the room towards Quicksilver’s stall.\n11\n____________________\n1\ncadet: new member of the armed services\n2\nbarracks: place where soldiers sleep\n3\ntack: stable gear such as saddles and bridles\ne horse whinnied when he saw the tack, knowing what it meant. Aleks shushed\nhim, slinging the saddle on the door and slipping inside, easing the bridle on to the horse’s\nhead. Tossing the saddle on Quicksilver’s back, he fastened it tightly and slung the\nsaddlebag over the horse’s rear, buckling it swily. He grabbed the reins, running to press\nQuicksilver’s nose to his chest for a brief moment. ‘We need to be quiet, boy. No getting\nexcited.’\n12\nHow does the author’s description of Aleks’s plan in paragraph 1 impact the tone of the story?\nA It creates irony because everything happens the way Aleks thinks it will.\nB It creates confidence that Aleks will succeed because he knows what he must do.\nC It creates suspense as the reader wonders if something will go wrong for Aleks.\nD It creates confusion because not everything happens the way Aleks wants it to.\nWhat important idea does the author develop in paragraphs 1 and 2?\nA e Tellus army is poorly prepared for action.\nB Aleks has a plan that is based on the army’s routines.\nC Aleks is unsure about which office has his army enlistment papers.\nD e Tellus army guards will soon return to the barracks from dinner.\nWhich sentence states a theme of paragraph 3?\nA Overconfidence can lead to carelessness.\nB Pride in one’s kingdom is essential to military success.\nC Pain can prevent a person from reaching one’s goal.\nD Trust is difficult to establish and maintain.\n29\n30\n31\nHow does Aleks’s attitude change in paragraph 5?\nA It shis from exhausted to curious.\nB It shis from panicked to confident.\nC It shis from distracted to focused.\nD It shis from annoyed to surprised.\ne saying “Don’t let anything you” is an encouragement to pursue and achieve a goal despite\nobstacles. Which quotation from the story best reflects this idea?\nA “Aer that . . . he would find a way out. ere had to be one somewhere.” (paragraph 1)\nB “Luckily, the door was unlocked and the room empty; Shulga had obviously gone straight\nfrom the time-out room to dinner.” (paragraph 3)\nC “Aleks glanced at the clock; he knew he shouldn’t, but he’d always been the curious type.”\n(paragraph 6)\nD “A quick glance through the glass panel showed the corridor to be empty, so Aleks\nslipped from the room.” (paragraph 9)\nRead these sentences from paragraph 12.\n‘We need to be quiet, boy. No getting excited.’\nWhat do these sentences reveal about Aleks?\nA He is aware that dangers may still await him.\nB He is questioning his decision to leave the army.\nC He is unfamiliar with how this horse will react.\nD He is reconsidering his plan of escape.\n32\n33\n34\nWhich sentence would be most important to include in a summary of the story?\nA Aleks notices that Shulga’s office is decorated the same as Antova’s office.\nB Aleks finds an Anglyan journal in a secret compartment in Shulga’s office.\nC Aleks fears someone is coming when he hears a door slam in the building.\nD Aleks slows his pace to avoid suspicion as he approaches the stables.\n35\nRobotic Fish to Keep a Fishy Eye on\nthe Health of the Oceans\nby JoAnna Klein\nYou’re a fish in the ocean.1\nIt’s 2023 and humans have begun deploying swarms of sentinel robot fish along the\nreef where you live that will monitor your environment, track pollution and collect\nintelligence on your behavior. Welcome to the future, my finned fishy friends.\n2\nO.K., so you’re not a fish. And this sci-fi fishland doesn’t exist. But it could—not long\nfrom now.\n3\nAllow me to introduce SoFi—like “Sophie,” but short for “So Robotic Fish,” revealed\nin Science Robotics, by scientists at the Massachusetts Institute of Technology Computer\nScience and Artificial Intelligence Lab.\n4\ney explained how their finned robot was created, and how her first ocean swim on\na coral reef outside of Fiji went. Robotic fish like her could be essential to understanding\nand protecting marine life in danger of disappearing in a fragile ocean environment,\nthreatened by human activity and climate change.\n5\nis foot-and-a-half long robot mimics a real fish. She can swim in the ocean at\nspeeds up to half-its-body-length a second and at depths up to 60 feet below the surface.\nSoFi has a battery that will last 45 minutes before she shuts down.\n6\nShe’s not quite fish flesh, but she’s not a typical marine robot either. Although critical\nfor studying the ocean, remote operated vehicles and submersibles1 can be expensive to\nbuild and operate. ey also can startle the sea creatures they’re supposed to study. But\nwithout a line giving her away by connecting her to a boat, a noisy propeller or the big,\nrigid, awkward or angular body of a metallic land-alien, she doesn’t seem to bother or\nscare off real fish. Some even swim along with her. Sleek, untethered, relatively\ninexpensive and well-tolerated, SoFi may provide biologists a fish’s-eye view of animal\ninteractions in changing marine ecosystems.\n7\nFor this group of MIT roboticists, SoFi was a dream, combining their love of diving\nwith their work on so robots. She was also an engineering challenge.\n8\nSoFi started as a nine-inch silicon tail that wiggled with the assistance of a hydraulic\npump.\n9\n1\nsubmersibles: boats designed to do underwater research\n2\nunobtrusive: barely noticeable\n3\nschooling dynamics: forces that influence change as fish travel together in\nschools\n“I was amazed at how well it was working, how well I was able to get this tail to beat\nback and forth or swim le and right, like a shark or some other fish,” said Robert\nKatzschmann, a graduate student at MIT who led the team. “But we wanted to show this\nwasn’t just working on a test bench or table top.”\n10\nSoFi had to swim in the ocean—at multiple depths.11\nis meant waterproofing, buoyancy control, tweaking weight distributions and\nfiguring out an unobtrusive2 way to share information underwater. It also meant compact\nequipment.\n12\n“We wanted to build a fish,” said Mr. Katzschmann. “And the fish can’t be as big as a\nsubmarine—unless we wanted to build a whale.”\n13\nA couple years later SoFi had a finned body and head equipped with a camera, two-\nway hydrophone, battery, environmental sensors, operating system and communication\nsystem that allowed a diver to issue commands using a souped-up Super Nintendo\ncontroller.\n14\ne communication system was the biggest challenge, said Mr. Katzschmann,\nbecause normally it requires a cable. Common remote signals used for piloting aerial\ndrones don’t travel below water.\n15\nBut sound waves do.16\ney built their own language, sending coded messages on high-pitched sound waves\nbetween SoFi and the diver. Different bits of information were assigned their own tones,\nkind of like how numbers are represented by dial tones when you make a phone call. A\nprocessing system decoded and relayed the messages to tell the diver things like “SoFi is\ncurrently swimming forward” or command her to “turn le, 20 degrees.”\n17\ne high-pitched signals only travel about 65 feet and are inaudible to fish, although\nit’s possible some whales or dolphins could hear them, which may require future research.\n18\n“Our primary goal was to make something for biologists,” said Mr. Katzschmann. He\nenvisions a future network of sensor-clad SoFis for studying schooling dynamics3 or\nmonitoring pollution over time. Currently he’s working on primitive A.I. so SoFi can use\nher footage to identify and track real fish.\n19\nBut what if a real fish—or a shark—tracks SoFi instead?20\n“If a shark would have come and ate our fish, that would have been the most amazing\nfootage,” Mr. Katzschmann said.\n21\nWhy does the author use the phrase “my finned fishy friends” in paragraph 2?\nA to highlight the serious issues facing ocean life\nB to make readers feel a connection to the article\nC to establish the importance of SoFi’s fin technology\nD to help readers understand the ocean environment\nRead this sentence from paragraph 7.\nShe’s not quite fish flesh, but she’s not a typical marine robot either.\nWhich detail about SoFi best supports the idea expressed in this sentence?\nA SoFi may contribute to the protection of endangered marine life.\nB SoFi can swim at speeds that are similar to some fish.\nC Fish are not scared by SoFi and sometimes swim with her.\nD Divers issue commands to SoFi using a simple controller.\nWhich detail from the article best shows the author’s point of view about SoFi?\nA “Robotic fish like her could be essential to understanding and protecting marine life in\ndanger of disappearing . . .” (paragraph 5)\nB “is foot-and-a-half long robot mimics a real fish.” (paragraph 6)\nC “I was amazed at how well it was working, how well I was able to get this tail to beat back\nand forth or swim le and right . . .” (paragraph 10)\nD “And the fish can’t be as big as a submarine—unless we wanted to build a whale.”\n(paragraph 13)\n36\n37\n38\nWhich statement best explains how the ideas in paragraph 8 relate to the details in paragraphs 12\nthrough 14?\nA Engineers want to build a robot to explore marine life.\nB Engineers create a system to guide SoFi underwater.\nC Engineers focus on design requirements to achieve their goal.\nD Engineers develop SoFi to think and act like a small fish.\nOne aspect of technology that is oen stressed is its negative impact on the environment. Which\ndetail from the article presents a contrast to this idea?\nA “ey explained how their finned robot was created, and how her first ocean swim on a\ncoral reef outside of Fiji went.” (paragraph 5)\nB “But without a line giving her away by connecting her to a boat . . . she doesn’t seem to\nbother or scare off real fish.” (paragraph 7)\nC “SoFi started as a nine-inch silicon tail that wiggled with the assistance of a hydraulic\npump.” (paragraph 9)\nD “e high-pitched signals only travel about 65 feet and are inaudible to fish, although it’s\npossible some whales or dolphins could hear them . . .” (paragraph 18)\nIn paragraph 21, Mr. Katzschmann reacts positively to the idea that a shark might eat SoFi\nbecause that would\nA lead to further funding and research\nB test the strength of the underwater system\nC help biologists understand how to protect marine life\nD support the goal of studying animal interactions\n39\n40\n41\nWhich idea would be most important to include in a summary of the article?\nA SoFi uses coded messages to communicate.\nB SoFi receives commands from a remote control.\nC SoFi is an important tool for understanding ocean life.\nD SoFi is designed to swim at different speeds in the ocean.\n42\nMatt Trott works for the U.S. Fish and Wildlife Service.\nExcerpt from Keep the “Wild” in\nWildlife: Don’t Touch or Feed\nby Matt Trott\nPeople oen think doing nothing is quite easy, but sometimes it can be awfully hard.\nMany of us want to help wildlife when they appear to be in trouble, but in some cases, we\nneed to redirect these instincts.\n1\nGenerally, the best thing to do is leave the animal alone. is protects both you and\nthe animal. . . .\n2\nYoung wildlife usually are not orphaned, even if a parent can’t be seen. For example,\ndeer leave fawns alone for hours to look for food, and baby birds oen leave the nest\nbefore they can fly, hopping around on the ground for days with the parents sometimes\nelsewhere getting food. . . .\n3\nBy trying to help wildlife, you might really be hurting them. A man in Georgia\nrecently saw a manatee1 out of the water. Concerned it was stuck, the man pushed the\nmanatee back into the water. Scientists said the manatee was very likely just sunbathing on\na warm December day.\n4\nYour “help” could also end up hurting you. e man in Georgia was fine, but even\npeople trained in manatee rescues are injured occasionally. Manatees may look slow and\ntoo bulky to cause injury, but a lot of strength and energy is hidden within their thick\nhide. . . .\n5\nFinally, wild animals are hardier than we think. A recent car commercial depicts a\ncouple “rescuing” a bird from cold weather and driving it south. is type of activity is\nillegal (unless permitted) and can be dangerous for the humans and the animal.\nTransferring a bird or other wildlife may disorient2 it or cause other problems.\n6\nSometimes, though, wildlife definitely need our help. You’ll know a wild animal\nneeds help if it has a visibly broken limb, is bleeding, has a dead parent nearby, or is\nhopelessly tangled in some manmade object.\n7\nIf that’s the case, contact a licensed wildlife rehabilitator.3 ey are trained and have\npermits to care for wildlife. ey can tell you what steps can be taken until help arrives.\nNot only that, but if they are truly in need, many animals require expert attention\nimmediately.\n8\n____________________\n1\nmanatee: a very large mammal that lives in warm waters along the Atlantic coast\n2\ndisorient: confuse, especially about location\n3\nrehabilitator: a person who helps bring an animal back to its uninjured state; also\ncalled a rehabber\n4\nmalnourished: lacking enough food or the right food for good health\n5\nneurological: nerve\nat’s what Officer Richard Bare did when he received a call that some baby raccoons\nwere orphaned aer their mother was hit by a car. He took them to a wildlife\nrehabilitation facility.\n9\nMigratory Bird specialist Bob Murphy did that, too. Last year, while Bob was getting\nhis canoe ready for a canoe trip, a friend spotted an osprey hanging upside down, tangled\nin fishing line, way up in a nearby pine tree.\n10\nBob eventually climbed the tree and cut away the fishing line. He then carefully\nplaced the bird into a backpack, climbed down the tree and took the bird to a rehabber.\ne osprey was somewhat dehydrated and malnourished,4 had a slightly injured toe and\nsuffered neurological5 problems from hanging upside down for some time. However, it\nrecovered and was released.\n11\nese are “hands-on” examples of experts providing help when wildlife are in\ntrouble, and they still both involve wildlife rehabilitators. Wildlife rehab is the answer for\nan injured animal. But, in general, the best bet for your safety, and that of the animal\ninvolved, is to leave wildlife alone, whenever possible keeping them truly wild.\n12\nis question is worth 2 credits.\nRead this sentence from paragraph 12 of “Excerpt from Keep the ‘Wild’ in Wildlife.”\nBut, in general, the best bet for your safety, and that of the animal\ninvolved, is to leave wildlife alone, whenever possible keeping them truly\nwild.\nWhat does the phrase “keeping them truly wild” suggest about helping wildlife in trouble? Use\ntwo details from the article to support your response.\n43\nStephen R. Swinburne has worked as a park ranger. When he swam alongside a\nmanatee, he reached out and scratched its belly, and the manatee made clicking sounds.\ney interacted for about a minute before the manatee swam away.\nExcerpt from Saving Manatees\nby Stephen R. Swinburne\nMy excitement is tinged with1 guilt, though. I know I shouldn’t touch a manatee. I\nbelieve in the “no touch” policy when it comes to wild animals. Wild animals remain wild\nwhen man does not interfere with their behavior. e naturalist2 part of me says, “Don’t\ntouch,” but to satisfy my human curiosity, I reach out. While I struggle with this dilemma\non a personal scale, Floridians are grappling with just how close humans and manatees\nshould get.\n1\nSome groups in Florida believe people should not be allowed to “swim with the\nmanatees” or touch them. And there are others, such as diving and snorkeling companies,\nthat believe it’s okay to snorkel with wild manatees and okay to touch them.\n2\nI raise the issue with the fourth-graders aer our snorkeling trip with the manatees in\nCrystal River. Should people be allowed to swim with manatees? Why or why not? Many\nof the students loved snorkeling with manatees. I hear reactions such as “Way cool!”,\n“Awesome!”, “e most amazing trip of my life.” But aer some reflection, Kalli speaks up\nand says, “Even though it was fun for us, I don’t think people should be allowed to swim\nwith manatees or touch them because it disturbs their peacefulness.”\n3\nIt’s the old idea of what one does is fine, but if the thousands of people that search for\nmanatees each year wanted to touch, rather than simply look at manatees, the pressure on\nthe animals would be too much. “Look, but don’t touch” may be the best way to mind your\nmanatee manners. And besides, people actually have the most to gain by remaining at a\ndistance when they spot a manatee in the water. By quietly observing manatees, snorkelers\nwill get a rare opportunity to see the natural behavior of these unique animals.\n4\ne one thing swimming with the wild manatees did for all of us was make us\nadvocates3 for manatees. But in the end, I agree with Kalli. Who knows? Maybe some day\npeople visiting Florida’s warm-water springs and rivers may talk about the good old days\nwhen people could snorkel with the manatees. Can you imagine that? ey actually got in\nthe water and touched a manatee. ose were the days.\n5\n1\nis tinged with: contains a little bit of\n2\nnaturalist: person who studies nature\n3\nadvocates: people who work for or argue for a certain cause\n4\nsusceptible: open to risk",
    "lexile_band": "1120L",
    "word_count": 3910,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/ny_state/2023-released-items-ela-g8.pdf",
    "grade": 8,
    "state": "NY",
    "created_at": "2025-12-31T15:18:44.228Z"
  },
  {
    "id": "e1b8b4a2-1e1f-4416-8b39-b3066f2192e6",
    "genre": "informational",
    "title": "A Rite of Passage (and the\nImportance of Penguin Etiquette)",
    "text": "1 There’s a common expression, “No pain, no gain,” which means that\nachievement requires some sort of sacrifice—mental sacrifice, physical\nsacrifice—something. Little did I know how important that phrase would soon\nbecome in my life, all because of an invitation to witness, up close and personal,\nsome of the most fascinating (and loveable) animals on this planet.\n2 When my fourteen-year-old daughter, Claire, and I found out that we were\ngoing to Antarctica to visit with and study the emperor penguins, we were\nthrilled. We had entered and won an essay contest. The grand prize promised an\nalmost unfathomable adventure: three weeks living aboard a Russian icebreaker\nship near an icy, remote outpost called Snow Hill Island.\n3 Getting to Antarctica is no small feat. It is\nextremely difficult to fly there, as the official\npopulation is zero. The few who are lucky\nenough to visit this most mysterious continent\ndo so by ships.\n4 This is where the “pain” comes in. You\nsee, to reach Antarctica, ships must pass\nthrough a notoriously violent area of ocean\ncalled the Drake Passage, considered to be the\nroughest stretch of sea on the planet.\n5 Walls of water thirty, sometimes forty feet\nhigh—tremendous towers of dark green, icy\nwaves—continually crashed about our ship for\ntwo solid days. We would hold on to a railing inside the ship while being violently\ntilted to one extreme side, then to the other, and then back again. Over and\nover and over, non. If not for the belt straps on our cabin bed, we would\nhave flown up in the air as we tried to sleep.\n6 My daughter and I knew about the Drake Passage and were as mentally\nprepared as we could be. We knew what waited at the end of the journey—the\npenguins—and so together we convinced ourselves it was all worth the pain. But\nas mentally prepared as we were, we also had to be physically aware, as well. It\nwas important to always watch our footing as we crept to the dining room each\nday to carefully grab a quick meal before returning to our cabin to ride out the\nsickening, never-ending storm.\n7 I started to wonder, “Is this worth it? Will the gain be worth all of this\nstruggle?”\nEW\nN\nS\nD\nr\na\nk\ne\nP\nassa\ng\ne\nSouth\nAmerica\nPacific\nOcean\nAtlantic\nOcean\nAntarctica\nReading\n8 Then, about two and a half days after entering the Drake Passage, the\nwaters calmed. For the first time on our journey, we walked out on deck and felt\nthe sweet bite of the cold, clean air on our faces.\n9 Soon, we noticed small black specks on nearby pieces of floating ice.\nEmperor penguins! The closer our ship got, the more it seemed as if the animals\nwere welcoming us—some of them actually beating their wings together, as if\nthey were applauding our arrival.\n10 Before long, we reached our final destination, and we were allowed to take\nour first ice walk. Across the crunchy surface, we could see hundreds of\npenguins in the distance, watching us as we watched them.\n11 As we learned on board, their interest was to be expected. Penguins are\nextremely curious and not fearful of humans.\n12 The next day, two helicopters that would take us from our ship to the base\ncamp were assembled on the deck of the ship.\n13 After landing, we were given instructions on “penguin etiquette.” These\nwere the basic rules: You can’t touch a penguin, but they can touch you if they’d\nlike. You can’t crowd them, but they can crowd you if they so desire. And you\nalways give them the right of way. Beyond those rules, we were free to explore,\nphotograph, and observe to our heart’s content.\n14 We began the two-mile hike over the ice to the penguin colony.\n15 Within several hundred yards, little clusters of emperors, perhaps ten or so\nat a time, greeted us, sliding on their bellies and making their wonderful noises,\nsort of a nasally squeal. But the real treat still awaited: the colony.\n16 As far as we could see, there were emperor penguins—tens of thousands of\nthem, stretched out to the horizon line. It was breathtaking. Thousands of newly\nhatched chicks waddled among the adults, vying for attention.\nReading\nA Colony of Emperor Penguins\nat Snow Hill Island\nJonathan & Angela Scott/Getty Images\n17 We found a quiet piece of ice, sat down, and within minutes were\nsurrounded by dozens of curious emperors. In some cases, their beaks were just\ninches from our noses.\n18 One day, two adult emperors with their three chicks in tow approached\nClaire, who was resting on the ice. They left the chicks with her, as if she were\nthe babysitter. Twenty minutes later they returned to collect the chicks. And I\nwill never forget the penguin that, when I jokingly asked which way back to the\nhelicopters, pointed a wing in the correct direction.\nEmperor Penguin Chicks\nFrank Krahmer\n19 Every night aboard our safe and warm ship, we thought about what it takes\nto survive in Antarctica, an incredibly harsh place.\n20 But each day on the ice, we also thought about the Drake passage, that\nmonstrous body of water we had to endure to get where we were. Over the\ncourse of our visit, we came to respect and even revere the power of that sea.\nReading\nReading\n22 No pain, no gain.\n21 We still talk about the penguins, as I’m sure we always will. But we talk\nabout the Drake too. Both experiences were unforgettable, and one would not\nhave been possible without the other.\nFrom Breakfast on Mars and 37 Other Delectable Essays: Your Favorite Authors Take a Stab at the Dreaded Essay\nAssignment © 2013 edited by Rebecca Stern and Brad Wolfe. Reprinted by permission of Roaring Brook Press, a division\nof Holtzbrinck Publishing Holdings Limited Partnership. All rights reserved.",
    "lexile_band": null,
    "word_count": 997,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/texas_staar/2019-staar-8-reading.pdf",
    "grade": 8,
    "state": "TX",
    "created_at": "2025-12-31T15:18:49.125Z"
  },
  {
    "id": "57f3aa71-5f7b-42b8-b680-dcd8dbeb6add",
    "genre": "informational",
    "title": "the answer on your answer document.",
    "text": "Candice’s science teacher has asked her to write about an important geographical\nregion. Read Candice’s paper and think about the revisions that she should make.\nWhen you finish reading, answer the questions that follow.\nThe Great Barrier Reef\n(1) One of nature’s most amazing structures is a maze of islands and coral.\n(2) The Great Barrier Reef, an ecosystem of a combined 3,000 coral reefs, sits off the\nnortheastern coast of Australia in the Pacific Ocean. (3) Located within the much\nlarger Great Barrier Reef Marine Park, the reef is the largest geographical formation\nof living organisms in the world. (4) It hosts many types of water habitats, making it\nhome to diverse marine life. (5) This colorful reef and its many inhabitants create a\nspectacular sight. (6) The reef attracts millions of tourists every year. (7) More than\njust a pretty place, the Great Barrier Reef provides plentiful sea life to study and\nresearch. (8) The Great Barrier Reef is all of these things to Australia and so much\nmore.\n(9) Although it now covers an area of 135,000 square miles, the Great Barrier\nReef started out much smaller. (10) Many years ago, when a low-lying coastal plain\nwas flooded by the rising sea, hills were partially submerged and gradually\ntransformed over time into islands. (11) Intense sunlight flooded the hard island\nsurfaces found within the shallow waters. (12) These surfaces were prime locations\nfor small saclike animals called coral polyps to attach themselves. (13) The coral\npolyps reproduced and then died, leaving their skeletons behind. (14) Plants, algae,\nsand, and small organisms began to fill in the spaces around the leftover materials.\n(15) This process created a foundation where a colony of polyps could repeat the\ncycle. (16) As the sea and wind continued to bring in new sand and organisms, the\ncoral reef grew. (17) This reef became a linear chain of multiple coral reefs, creating\na physical barrier that stretches about 1,000 miles along the coast. (18) Bigger than\nthe Great Wall of China and visible from space, this enormous organism is home to\nmany other smaller ones.\nEnglish I\n(19) Several types of animals attach themselves to the walls of coral as if the\nanimals were part of the reef. (20) Marine animals, including protozoa and sea\ncucumbers, help secure sand and plant algae to the reef. (21) Sponges and soft\ncoral living alongside bright red and purple plant algae provide stunning color along\nthe reef.\n(22) The water surrounding the reef is teeming with life as well. (23) Many\nanimals, such as marine insects and about 500 species of worms, swim in areas near\nthe reef. (24) Microscopic plankton float freely and help feed many of the aquatic\nanimals. (25) Larger animals living near the reef include jellyfish, octopuses, and\nsaltwater crocodiles as well as over 1,600 species of fish, over 20 species of seabirds,\nand about 30 species of marine mammals, including dolphins and whales.\n(26) Animals large and small live close to the reef.\n© iStock.com/blublaf\n© iStock.com/KJA\n© iStock.com/tane-mahuta\n(27) The Great Barrier Reef provides many environmental and economic\nbenefits. (28) The coral reefs help protect the other coastline ecosystems, which\ninclude forested floodplains, freshwater wetlands, and la floors, from storms and\nerosion. (29) The Great Barrier Reef also provides sources of food for millions of\npeople and serves as a good home to economically important fish species.\n(30) Among these species are salmon, shark, and mackerel that supply commercial\nfisheries, big game marlin that fuel sport fishing, and the colorful little clownfish that\nattract snorkelers and divers. (31) Humans rely on the coral reefs for food,\nrecreation, and tourism. (32) The reef’s ecosystem is even explored by researchers\nas a possible source of new medicines. (33) Such explorations highlight that these\ncoral reefs foster some of the most extraordinary underwater systems on the planet.\n(34) Because of its global significance, the Great Barrier Reef is classified as\none of the seven wonders of the natural world. (35) In conclusion, the Great Barrier\nReef of Australia is a very cool feature of nature.\nEnglish I",
    "lexile_band": null,
    "word_count": 684,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/texas_staar/2019-staar-english-i-test.pdf",
    "grade": 9,
    "state": "TX",
    "created_at": "2025-12-31T15:18:49.433Z"
  },
  {
    "id": "1783831d-429d-4026-9187-aee1a9b062d1",
    "genre": "literary",
    "title": "the answer on your answer document.",
    "text": "A Lasting Impression\n1 The first-day jitters were impossible to ignore as Lucy Falls walked through\nthe tall glass doors of her new school. Though she was excited for the\nopportunity to study cinema at the School of the ARTS, she now wondered if she\nhad made a terrible mistake by transferring in the middle of the year. Trying to\nshake off the early morning’s frustration, she wiped her clammy hands on her\nnavy sundress and focused her attention on finding her first-period class.\n2 Finishing her paperwork had taken forever. The office aide had instructed\nher to go back through the foyer and take the staircase on the right down to the\nbasement. Just as Lucy started walking, the bell for first period rang, sounding\nto her like a signal of doom.\n3 Great, she thought. Now not only am I new, I’ll be late too.\n4 She marched quickly through the foyer and made it to the stairwell.\nDistracted by a group of tardy students who had congregated at the top to take\nselfies, Lucy tripped over her first step. She stumbled, fell, and then skidded all\nthe way to the bottom, purse and bag sliding down behind her.\n5 “Smooth feet, newbie!”\n6 “That’s gotta hurt!”\n7 As she picked herself up, Lucy couldn’t decide what hurt more—her body or\nher pride. She took a few deep breaths and realized she was now standing in\nfront of her first-period class. She worried that the longer she waited to get to\nclass, the worse this day would go. She needed a second chance to make a good\nfirst impression.\n8 Only like four people saw me fall, she told herself. No big deal.\n9 First period went by uneventfully, and Lucy even introduced herself to a\ncouple of the girls who sat behind her. By the time she was headed to second\nperiod, she had relegated the fall to the back of her mind.\n10 She pushed open the door to Intro to Cinema, the class she was most\nlooking forward to at this new school. Students looked her way, and whispers\nsnaked from group to group. Lucy felt her face get hot, and she decided that\nmaybe this day actually could get worse. A couple of kids were huddled in the\nback around one of the classroom laptops, and she assumed they were talking\nabout her.\n11 How in the world had word gotten around so fast? As she stood awkwardly\nfacing the class, the mantra her mother had repeated since she was a little girl\ncame to mind. “Remember, honey. Lucy never falls,” her mother would say when\nthings didn’t go Lucy’s way.\nReading\n12 I bet Mom never imagined this scenario, Lucy mused, rolling her eyes.\n13 “Settle down, class,” the teacher said sternly to the students, who quieted.\nShe directed her attention toward Lucy and gave her a welcoming smile. “You\nmust be Lucy Falls. Today we are discussing our 30-second film project. I\nbelieve the details were in the outline you received before you transferred. You\ncan join group four. I’m sure whatever is so distracting on that laptop will be\ngone by the time I make it over there,” she said, directing a pointed look to the\ngroup at the back of the classroom.\n14 Fearing the worst, Lucy approached the group.\n15 “That fall was epic!” An enthusiastic redhead beamed at Lucy as she sat\ndown. Grinning widely he stuck his hand out and shook Lucy’s.\n16 “I’m Rodney!”\n17 The other group members, one looking intently at the laptop and the other\nquickly jotting notes into a journal, ignored Lucy.\n18 Lucy sighed. “I don’t know if that’s necessarily the right word to describe\nit.” Rodney chuckled and shrugged his shoulders. “Someone was recording a\nvideo of my friend, and it’s impossible to miss your wipeout in the background!”\n19 The girl who was huddled over the laptop giggled. For the millionth time\nthat day, Lucy’s face got hot, and again she began to doubt the wisdom of\ntransferring to the magnet school altogether.\n20 Rodney continued. “Hey, I hope you don’t think I’m making fun of you!\nActually, I think you’re going to save our 30-second film project! Your name has\nperfect potential for a star character—Lucy Falls!” He gestured as if her name\nwere shining in lights. “The fact that you also fell, quite gracefully I might add,\nmakes it the perfect play on words! You’re going to be the inspiration for our\nproject!”\n21 Lucy allowed herself a small smile. It hadn’t been a good start, but Rodney\nwas definitely making her first day less terrible.\n22 “I’ve been working on some edits from this clip that we have,” the girl on\nthe laptop said suddenly, turning the computer toward Lucy and showing her\nwhat she’d been working on so intently. “I’m Alicia—sorry—I wanted to capture\nmy thoughts before I forgot. We’ve been struggling to come up with a concept,\nbut this is sheer genius!”\n23 As Alicia and Rodney talked excitedly, Lucy’s embarrassment began to\ndissipate. She listened for a few moments, watching Alicia’s film clip transform\nher stairway disaster into drama; then, she pulled up a chair and joined in as\nthe group brainstormed ideas for Lucy Falls.\n24 Her mother’s mantra came to mind, and Lucy smiled to herself. Well, Mom,\nsometimes Lucy DOES fall . . . but at least she makes a lasting impression!\nReading",
    "lexile_band": null,
    "word_count": 913,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/texas_staar/2021-staar-8-reading.pdf",
    "grade": 8,
    "state": "TX",
    "created_at": "2025-12-31T15:18:50.286Z"
  },
  {
    "id": "fd73ed97-de96-4148-b786-e442f4c36a04",
    "genre": "informational",
    "title": null,
    "text": "to each\nquestion.\nfrom Villages in the Sky\nby Ellen Garin\nLost and Found!\n1 One December morning in 1888, Richard Wetherill and\nhis brother-in-law, Charles Mason, were riding along a mesa\nin the mountains of southwestern Colorado searching for lost\ncattle. Their breath turned to vapor in the cold December\nmorning air, and the snow on the ground crunched under their\nhorses’ hooves.\n2 The cowboys followed the cattle tracks until they heard\nthe lowing of their cattle. After they had counted the herd, they\nlooked around at the spectacular views. As they looked across\nthe vast canyon, something caught their attention. There,\nnestled high up under an overhanging cliff on the other side of\nthe canyon, was something quite amazing. The cowboys rode\naround to the other side of the canyon, dismounted, and climbed\ndown the cliff on foot to get a closer look. They were about to\nmake an important discovery.\nThe Cliff Dwellings at Mesa Verde\n3 Wetherill and Mason had discovered a large cliff dwelling\nthat had been abandoned hundreds of years ago by ancient\nPueblo people. It had been built into an alcove where chunks\nof sandstone had fallen off the cliff, creating an overhang. The\noverhang protected the cliff dwelling from the weather, which is\nwhy it was intact hundreds of years later.\n4 Like apartment houses today, the dwellings were multilevel,\nhousing many families. People needed to climb up or down\nladders to reach lower and upper levels of the cliff dwellings.\nLiving areas in the complex were about six by eight feet. Their\nceilings were made of wood planks, and some homes had\ncolorful wall paintings. The low height of the doorways indicates\nthat people then were shorter than they are today.\n5 Below the living area, and reached only by ladder, was\na round room called a kiva (KEE-vuh), which was used for\nceremonial purposes.\n© Scott macneill\nEnglish II\n6 The cliff dwellers were clever builders. They constructed\nventilation shafts inside the kivas for fresh air, and each fireplace\nhad a deflector in front of it that helped to circulate the heat\nand the fresh air. The underground kiva stayed at 50 degrees\nFahrenheit year-round. It was cool in the heat of summer, and\nonly a small fire was needed to keep it warm in winter.\n7 The kiva’s roof formed a courtyard above, which was an\narea used for working and gathering together. There, women\ndried food for storage, wove cloth and baskets, and tanned hides\nfrom the animals the hunters brought home. People gathered\nin the courtyard to trade stories while children played and dogs\nand turkeys wandered about.\nThe Ancestral Puebloans\n8 For about 700 years, Mesa Verde was a thriving community\nof many thousands of Native American people now referred to\nas Ancestral Puebloans. These people were master builders,\nskilled craftsmen, and adept farmers of a difficult, dry land. They\nalso traded surplus goods and food with other Native American\ncommunities.\n© Scott macneill\nEnglish II\n9 The earliest Ancestral Puebloan settlements date back to\nthe year 600. For most of their time in the Mesa Verde area,\nthese people lived in houses and farmed on top of the mesa.\nTheir first villages consisted of homes called pit houses, which\nwere constructed by digging a shallow pit in the ground. A roof\nwas made by crossing poles over the top of the pit and then\ncovering the poles with branches, grass, or tree bark. The walls\nof the pit house were often lined with clay or stones.\n10 Eventually, the Ancestral Puebloans began building\nhomes above ground that were constructed of adobe and were\nsometimes two or three stories tall. The people farmed the\nland on top of the mesa, where they grew crops such as corn,\nbeans, and squash. The mesa got little rainfall and was not\neasy land to farm. However, the farmers were expert in dryland\nfarming, creating check dams1 and channels to direct rainwater\nto their crops.\n11 The people gathered wild plants to supplement the food\nthey grew, and they hunted animals such as rabbits and deer.\nThey also used turkeys for food, bone for tools, and feathers for\nclothing. Dogs were kept as pets and for protection.\n1A check dam is a small dam constructed across a drainage ditch or channel to regulate water\nflow and limit erosion.\nEnglish II\n12 Then around 1100, these [Ancestral Puebloans] mastered\nthe art of masonry. During the next hundred years they built\nremarkable cliff dwellings such as Cliff Palace. Now the Ancestral\nPuebloans no longer lived on top of the mesa. Their homes were\nbuilt into the side of the cliff. People had to climb up to the mesa\nusing footholds and handholds carved into the side of the cliff to\ntend their crops or hunt for food.\n13 Around 1270, the Ancestral Puebloans left Mesa Verde,\nalthough we are not entirely sure why they left. We do know\nthat these people settled the area that is now the home of\nthe modern Pueblo tribes, including the Hopi, Zuni, Acoma,\nand Laguna.\n6518\nEnglish II",
    "lexile_band": null,
    "word_count": 853,
    "source": "/Users/christopher.haid/Dev-Projects/clearcut/content/real_passages/texas_staar/2023-staar-english-ii-practice-test.pdf",
    "grade": 9,
    "state": "TX",
    "created_at": "2025-12-31T15:18:50.800Z"
  }
]